Revit 2026 API

# BuiltInFailuresColumnFailures Class

---

Failures about Columns.

SystemObject Autodesk.Revit.DBBuiltInFailuresColumnFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ColumnFailures
```
```vb
Public NotInheritable Class ColumnFailures
```
```cpp
public ref class ColumnFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ColumnFailures = class end
```

The BuiltInFailuresColumnFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ColumnAndTargetAreConcrete | Column and target are both concrete. Geometries have been joined. |
|  | ColumnBaseAboveTopError | The column base can't be moved above its top. |
|  | ColumnBaseAboveTopFailure | The column base can't be moved above its top. |
|  | ColumnJoinNonhitFailure | The highlighted column can't maintain attachment to the target. It will be treated as unattached until it can intersect. |
|  | ColumnTopBelowBaseError | The column top can't be moved below its base. |
|  | ColumnTopBelowBaseFailure | The column top can't be moved below its base. |
|  | ColumnZeroHeightError | The column can't have zero height |
|  | ColumnZeroHeightFailure | The column can't have zero height |

#### Reference

Autodesk.Revit.DB Namespace